artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20

scenarios:
  - name: "Teacher Login"
    flow:
      - post:
          url: "/teachers/login"
          json:
            username: "arthurb"
            password: "test123"
        capture:
          - json: "$.token"
            as: "accessToken"
            log: true

  - name: "Create Assignments"
    flow:
      - post:
          url: "/assignments"
          json:
            name: "Project 2"
            description: "Create an API"
        headers:
          Authorization: "Bearer {{accessToken}}"